
import * as api from 'api';
import * as os from 'os';

//*************************** 图标检测 ***************************
let process_hash_black_table = [
	//-----------在此分割线之间维护内容-----------
	0x08B441EB,/*倍攻*/
	0x28D0AEC8,/*同步器*/
	0x7389B4C0,/*鼠标脱机*/
	0x54E7B924,/*鼠标脱机*/
	0x334D5D57,/*鼠标脱机*/
	0x10B6E537,/*鼠标脱机*/
	0x0A40324F,/*鼠标脱机*/
	0x54E7B924,/*鼠标脱机*/
	0x6552E3B6,/*鼠标脱机*/
	0x13090C65,/*隐藏工具*/
	0x48D479F6,/*一键小腿*/
	0x5305B843,/*鼠标脱机*/
	0x1FF7BE33,/*鼠标脱机*/
	0x6B6BDC1B,/*鼠标脱机*/
	0x6F1D7B71,/*鼠标脱机*/
	0x46850109,/*鼠标脱机*/
	0x4A2E0A36,/*鼠标脱机*/
	0x23853312,/*鼠标脱机*/
	0x70FBA87F,/*鼠标脱机*/
	0x0C854B24,/*鼠标脱机*/
	0x5A511D59,/*鼠标脱机*/
	0x41AA87A6,/*鼠标脱机*/
	0x7E2042D2,/*鼠标脱机*/
	0x652266D9,/*鼠标脱机*/
	0x0B4C17DE,/*鼠标脱机*/
	0x60AB268F,/*鼠标脱机*/
	0x2576A782,/*鼠标脱机*/
	0x5F9DAD6C,/*鼠标脱机*/
	0x4A2E0A36,/*鼠标脱机*/
	0x3FED93BF,/*鼠标脱机*/
	0x21C8AC7C,/*鼠标脱机*/
	0x204832AE,/*鼠标脱机*/
	0x42E8E30E,/*鼠标脱机*/
	0x5621C99A,/*鼠标脱机*/
	0x5FCC5B2C,/*鼠标脱机*/
	0x699D91C8,/*鼠标脱机*/
	0x5D95E4B4,/*鼠标脱机*/
	0x4EBDB412,/*鼠标脱机*/
	0x6B48E017,/*鼠标脱机*/
	0x77CC3CE7,/*脚本编辑*/
	0x351692BA,/*鼠标脱机*/
	0x351692BA,/*鼠标脱机*/
	0x7F467533,/*鼠标脱机*/
	0x16A48FA0,/*鼠标脱机*/
	0x1EF78D02,/*鼠标脱机*/
	0x2ABF3140,/*鼠标脱机*/
	0x3E41750E,/*鼠标脱机*/
	0x56F42C50,/*鼠标脱机*/
	0x56F98CE2,/*鼠标脱机*/
	0x1C9A895E,/*鼠标脱机*/
	0x6DE03177,/*鼠标脱机*/
	0x3B654D41,/*鼠标脱机*/
	0x56F42C50,/*鼠标脱机*/
	0x395A358B,/*鼠标脱机*/
	0x344857B0,/*血手鼠标*/
	0x7A56D22F,/*血手鼠标*/

	0x64B69FD6,/*定制脱机*/
	0x75B60716,/*水仙外挂*/
	0x30DDF327,/*水仙外挂*/

	0x2AA74E08,/*暗魂免费版*/
	0x50FA2082,/*封包助手*/
	0x792B0B45,/*乐玩编程*/
	0x37B66342,/*封包拦截*/
	0x4346EC43,/*封包拦截*/
	0x7FB995A7,/*封包拦截*/
	0x71399619,/*封包拦截*/
	0x01130790,/*封包拦截*/
	0x2E81C460,/*封包拦截*/
	0x4797662D,/*封包拦截*/
	0x54A2ED9F,/*WPE*/
	0x1186427A,/*WPE*/
	0x5C72A221,/*WPE*/
	0x5EF4C864,/*WPE*/
	0x5371DD82,/*WPE*/
	0x5B1F2A2A,/*WPE*/
	0x5E0FFBDB,/*VE封包*/
	0x4231932F,/*CE封包*/
	0x7BADB743,/*CE封包*/
	0x2393D5D9,/*QE封包*/
	0x068D494F,/*QE封包*/
	0x3565726C,/*游戏数据修改*/
	0x17E4DF67,/*游戏数据修改*/
	0x0D9407DC,/*游戏数据修改*/
	0x15B70BCC,/*游戏数据修改*/
	0x3C5DB794,/*游戏数据修改*/
	0x169CA0D1,/*水仙外挂*/
	0x5DAA256D,/*水仙外挂*/
	0x1F45316A,/*水仙外挂*/


	0x58433FE6,/*GEE高端定制*/
	0x5ACF4982,/*词条检测*/
	0x0AE4D45D,/*及时雨*/
	0x75ADE23B,/*简单外挂*/
	0x31AE3C60,/*简单外挂*/
	0x3E773F97,/*简单外挂*/
	0x3CD8F73B,/*简单外挂*/
	0x5A38A551,/*简单外挂*/
	0x62649F2E,/*简单外挂*/
	0x658A6A5D,/*荣耀外挂*/
	0x23BD5F32,/*时空变速*/
	0x2532ABAB,/*无忧变速*/
	0x0708A972,/*无忧变速*/
	0x0F24A8DE,/*变速齿轮*
	0x131F1FC4,/*变速齿轮*
	0x359E52ED,/*变速齿轮*
	0x50EABE09,/*变速齿轮*
	0x338DB09D,/*变速齿轮*
	0x02740293,/*变速齿轮*
	0x4616A65A,/*变速齿轮*
	0x475540AE,/*变速齿轮*
	0x16AF4573,/*变速齿轮*
	0x0FD0C63F,/*变速齿轮*/
	0x0FF856F6,/*变速齿轮*/
	0x67C8E079,/*变速齿轮*/
	0x44604D2D,/*2021暗龙*/
	0x52EFA37A,/*2021刺客*/
	0x6C018827,/*驱动变速*/
	0x2D608CA5,/*驱动变速*/
	0x54698CBB,/*驱动变速*/
	0x744D2B3E,/*驱动变速*/
	0x4E8CAD4E,/*驱动变速*/
	0x7BC6179F,/*驱动变速*/
	0x300EDF1C,/*变速精灵*/
	0x7FB7692B,/*小可爱2021*/
	//*************************** 老图标检测 ***************************
	0x345EA204,/*词条检测*/
	//-----------在此分割线之间维护内容-----------
];

let process_hash_black_table2 = [
	//-----------在此分割线之间维护内容-----------

	//-----------在此分割线之间维护内容-----------
];

let process_hash = api.enum_process_hash();
process_hash.forEach(function (e) {
	if (process_hash_black_table.indexOf(e[1]) != -1) {
		api.report(689021, true, e[0] + "|" + e[1].toString(16));
	}
	if (process_hash_black_table2.indexOf(e[1]) != -1) {
		api.report(689020, true, e[0] + "|" + e[1].toString(16));
	}
})
//*************************** 图标检测 ***************************
