
import * as api from 'api';
import * as os from 'os';

//*************************** 图标检测 ***************************
let process_hash_black_table = [
	//-----------在此分割线之间维护内容-----------
	0x3FED93BF,/*鼠标脱机*/
	0x204832AE,/*鼠标脱机*/
	0x42E8E30E,/*鼠标脱机*/
	0x5621C99A,/*鼠标脱机*/
	0x5FCC5B2C,/*鼠标脱机*/
	0x699D91C8,/*鼠标脱机*/
	0x5D95E4B4,/*鼠标脱机*/
	0x4EBDB412,/*鼠标脱机*/
	0x6B48E017,/*鼠标脱机*/
	0x77CC3CE7,/*脚本编辑*/
	0x351692BA,/*鼠标脱机*/
	0x351692BA,/*鼠标脱机*/
	0x7F467533,/*鼠标脱机*/
	0x16A48FA0,/*鼠标脱机*/
	0x1EF78D02,/*鼠标脱机*/
	0x2ABF3140,/*鼠标脱机*/
	0x3E41750E,/*鼠标脱机*/
	0x56F42C50,/*鼠标脱机*/
	0x56F98CE2,/*鼠标脱机*/
	0x1C9A895E,/*鼠标脱机*/
	0x4E539B4B,/*鼠标脱机*/
	0x6DE03177,/*鼠标脱机*/
	0x3B654D41,/*鼠标脱机*/
	0x56F42C50,/*鼠标脱机*/
	0x395A358B,/*鼠标脱机*/
	0x344857B0,/*血手鼠标*/
	0x7A56D22F,/*血手鼠标*/
//*************************** 老图标检测 ***************************
                0x6759D293,/*国外鼠标录制*/
                0x7AF4CEE8,/*国外鼠标录制*/
                0x557A52FF,/*无忧加速器*/
                0x5A4306A6,/*QE外挂*/
                0x6EF97665,/*简单外挂*/
                0x20D01F42,/*一流变速器*/
                0x51244829,/*狂龙鼠标脱机*/
                0x16C5A4AC,/*狂龙鼠标脱机*/
                0x7D6FC8DB,/*按键模拟大师*/
                0x5823F3F5,/*寒星鼠标回收*/
                0x3939AC1B,/*鼠标精灵*/
                0x51451BF2,/*鼠标点击助手*/
                0x6B06A5CA,/*鼠标键盘录制工具*/
                0x09AC9280,/*血手脱机宏*/
                0x1A5E64FF,/*血手脱机宏*/
                0x4B30F414,/*按键游侠*/
                0x7945E05B,/*AutoHotkey*/
                0x515CFC92,/*GM8修改器*/
                0x25E2CE3F,/*乐玩编程助手*/
                0x4CD331AE,/*飞扬游戏修改器*/
                0x2AB10AB5,/*ArtMoney*/
                0x1F26B67B,/*鼠标连发器*/
                0x7D9BAA5A,/*简单鼠标宏*/
                0x309B4978,/*鼠标键盘记录*/
                0x453E75A7,/*鼠标键盘记录*/
                0x706CAA75,/*鼠标键盘记录*/
                0x28588EB2,/*鼠标键盘记录*/
                0x3874E143,/*鼠标键盘记录*/
                0x7A1B130D,/*鼠标键盘记录*/
                0x38F9190F,/*同步工具*/
                0x1794427F,/*同步工具*/
                0x10B7C52F,/*同步工具*/
                0x06BD1850,/*同步工具*/
                0x5CBF654E,/*同步工具*/
                0x381A1FC3,/*同步工具*/
                0x03F69A2D,/*同步工具*/
                0x7F9000D5,/*同步工具*/
                0x3FD0767D,/*同步工具*/
                0x5BE837DA,/*同步工具*/
                0x22522C84,/*未知定制*/
                0x2A958747,/*甜甜圈*/
                0x7F89577D,/*鼠标连点*/
                0x2FF3C5F8,/*鼠标连点精灵*/
                0x10157074,/*挂机宝*/
                0x072383A6,/*挂机宝*/
                0x434935DC,/*一只羊按键*/
                0x78680F25,/*天翼脱机*/
                0x10D63197,/*天翼脱机*/
                0x576914CD,/*模拟按键*/
                0x783EFADB,/*小脚本*/
                0x70DCB6C5,/*小脚本*/
                0x7FE1428A,/*万能按键*/
                0x5D159FFD,/*易键宝*/
                0x335441A2,/*小公主外挂*/
                0x6D758385,/*变速精灵*/
                0x2ACE99E1,/*变速精灵*/
                0x2FFAD486,/*变速精灵*/
                0x36BA8BF3,/*鼠大侠录制*/
                0x34A2ECC2,/*按键小精灵*/
                0x76841169,/*全能模拟王*/
                0x4805051A,/*封包修改*/
                0x3889B7BC,/*封包修改*/
                0x4B36290D,/*封包修改*/
                0x650E3C03,/*封包修改*/
                0x3E8FB61E,/*qe修改*/
                0x4189DBE2,/*传奇封包*/
                0x5B6BA468,/*变速大师*/
                0x5EE887FA,/*变速大师*/
                0x4D1AC8D9,/*唯美加速器*/
                0x144AB234,/*水上漂加速器*/
                0x46F883F1,/*刀锋助手*/
                0x45B16ACC,/*鼠标录制*/
                0x516628B8,/*鼠标录制*/
                0x3C7CF346,/*鼠标录制*/
                0x7A297187,/*鼠标录制*/
                0x7B092288,/*鼠标录制*/
                0x07AE33CE,/*鼠标录制*/
                0x3CD10C99,/*鼠标录制*/
                0x3332F7F2,/*鼠标录制*/
                0x7E44CEE4,/*鼠标录制*/
                0x1739F387,/*简单外挂*/
                0x7BC82E4B,/*简单外挂*/
                0x045AFCF3,/*简单外挂*/
                0x3616E1EE,/*简单外挂*/
                0x6471CE06,/*CE*/
                0x599124ED,/*刀锋外挂*/
                0x22304296,/*GEEjkaaa*/
                0x33517512,/*FSCapture*/
                0x36836402,/*QQ,工具箱9*/
                0x73AE920E,/*2018吉吉辅助*/
                0x65B26960,/*2018暗龙辅助,暗龙2020*/
                0x3287C659,/*9*/
                0x319739C5,/*A版挂机脚本编辑器,A版本脚本编辑器,A版脚本编辑器,gee-gom脚本编辑器*/
                0x216BC56A,/*esp-ZW1205*/
                0x36C8E71B,/*FSCrossHair*/
                0x0EFB8F3F,/*FSRecorder*/
                0x7573059C,/*g5ZlwYJe0k*/
                0x30C25D57,/*geem2会员版【官方正版】,一刀插件免费版,会员通杀版【官方正版】*/
                0x1DD85266,/*GEE通用版本*/
                0x31C2A2DC,/*K-2,PK加速*/
                0x02479776,/*PK*/
                0x568BFD60,/*PK专用插件2*/
                0x0CD3D104,/*tQqU*/
                0x561B25FC,/*Update,刺客7*/
                0x2A615ACE,/*VAR乱地图账号密码界面处理*/
                0x5B2E53F9,/*vip-旗舰版,秒杀辅助2*/
                0x4ADE709C,/*WinSrvManager*/
                0x1D8C50E6,/*一刀插件收费版*/
                0x658F46D1,/*七剑辅助2020通杀版*/
                0x3A1622A2,/*万千辅助免费版,万千辅助收费版*/
                0x0874F3E7,/*传奇易大师*/
                0x163BDD02,/*传奇通用变速器免费版,传奇通用变速器收费版*/
                0x781DB673,/*刀速B版*/
                0x4B4B255B,/*刺客6*/
                0x429F463F,/*十c-vip官方会员版*/
                0x3E18CC07,/*单挑王加速器2*/
                0x74ED714B,/*及时雨v1*/
                0x74B40E08,/*吕布2020*/
                0x5B97A6C6,/*处理器*/
                0x387D9B76,/*守护者收费版*/
                0x4CA2F0FA,/*小可爱官方会员版*/
                0x693A68F1,/*战舞客户端0627*/
                0x4F77C34F,/*新脚本编辑器*/
                0x7C8AAB17,/*晴天收费版*/
                0x106E4805,/*晴天至尊-2019-4-VIP版,晴天辅助会员版【官方正版】*/
                0x429D5895,/*暗魂免费版1*/
                0x2D3EE3C0,/*横刀*/
                0x6FE9E52D,/*永恒狂刀5*/
                0x32A5B1DD,/*永恒狂刀获取NPC命令工具*/
                0x00620091,/*灭魂辅助免费版*/
                0x05CC0284,/*点此打开*/
                0x6AB81BD9,/*烈日辅助官方会员版*/
                0x005B2B89,/*狩猎3,狩猎3,狩猎加速器,狩猎者3*/
                0x36ED51F5,/*王中王免费版,王中王收费版*/
                0x398C93E3,/*简单挂免费版*/
                0x00D78C2F,/*简单挂收费版*/
                0x20C8FEBA,/*脚本编辑器2019V1*/
                0x3BB7AFC2,/*脱机版*/
                0x6A591680,/*自动更新*/
                0x17BD85A0,/*简单类*/
		0x72827FF9,/*刺客辅助*/
		0x41E7D96A,/*AliApp*/
		0x2C4A0BC8,/*GEE,启动器*/
		0x0AE5D4C4,/*HW辉煌处理器,易大师定制版处理器*/
		0x6AEBCFC0,/*LeiGodSetup*/
		0x07985495,/*NetSpeed*/
		0x3A1A34B8,/*点击启动*/
		0x000BAD8A,/*移动宽带用户登录,移动宽带登录线路*/
		0x36836402,/*明月*/
		0x43074645,/*前锋加速*/
		0x41E7D96A,/*AliApp*/
		0x6C085F40,/*GEE大师*/
		0x075091E7,/*GEE猎手*/
		0x482A2F05,/*GEE管家会员版*/
		0x568BFD60,/*K PK外挂*/
		0x31C2A2DC,/*K加速*/
		0x02479776,/*PK辅助,天魔辅助*/
		0x0082E27A,/*七星辅助*/
		0x29D2DE39,/*乾坤加速器*/
		0x32BF3E3E,/*传奇私服扫号器V3*/
		0x022459C8,/*刺客辅助*/
		0x3E18CC07,/*单挑王加速器*/
		0x0C5CB728,/*大师多开器*/
		0x6585A6FD,/*天使辅助*/
		0x6C37B144,/*天逸辅助*/
		0x3A1A34B8,/*奇刃辅助*/
		0x48BEFD21,/*小手、飘逸*/
		0x693A68F1,/*战舞辅助*/
		0x106E4805,/*晴天至尊*/
		0x65B26960,/*暗龙辅助*/
		0x6FE9E52D,/*永恒狂刀*/
		0x32A5B1DD,/*永恒狂刀获取NPC命令工具*/
		0x00620091,/*灭魂辅助*/
		0x005B2B89,/*狩猎者加速器*/
		0x3287C659,/*老冰狼*/
		0x769CEE7A,/*老好人辅助*/
		0x2C4A0BC8,/*荣耀辅助*/
		0x7573059C,/*超级变速器*/
		0x4DDE8C1B,/*速战辅助*/
		0x70FB35E3,/*飘刀加速*/
		0x7D3EBBF4,/*晴天至尊*/
		0x3C271E7B,/*晴天至尊1*/
                0x303E4C29,/*剑魂辅助*/
                0x5B881226,/*无敌辅助*/
                0x00D78C2F,/*简单辅助*/
                0x0A4C0BD9,/*大名外挂*/
                0x592D0452,/*简单外挂*/
                0x17BD85A0,/*简单外挂*/
                0x0A6C741E,/*秒杀*/
                0x49630BA3,/*AliIM.exe*/
                0x1443563C,/*2020小可爱.exe_*/
                0x0E32E1A5,/*简尚自动按键_*/
                0x73C4E5F7,/*永恒狂刀*/
                0x122891F6,/*主宰辅助官方免费版.exe*/
                0x65D8B6C9,/*WPE.exe*/
                0x4D0AE3D2,/*WPE.exe*/
                0x749F70F9,/*CE*/
                0x43F18F71,/*cheatengine*/
                0x2DD47CBD,/*VE封包工具*/
	//-----------在此分割线之间维护内容-----------
];

let process_hash_black_table2 = [
	//-----------在此分割线之间维护内容-----------
        0x75B60716,/*水仙外挂*/
        0x30DDF327,/*水仙外挂*/

	0x50FA2082,/*封包助手*/
	0x792B0B45,/*乐玩编程*/
	0x37B66342,/*封包拦截*/
	0x4346EC43,/*封包拦截*/
	0x7FB995A7,/*封包拦截*/
	0x71399619,/*封包拦截*/
	0x01130790,/*封包拦截*/
	0x2E81C460,/*封包拦截*/
	0x54A2ED9F,/*WPE*/
	0x1186427A,/*WPE*/
	0x5C72A221,/*WPE*/
	0x5EF4C864,/*WPE*/
	0x5371DD82,/*WPE*/
	0x5B1F2A2A,/*WPE*/
	0x5E0FFBDB,/*VE封包*/
	0x7BADB743,/*CE封包*/
	0x2393D5D9,/*QE封包*/
	0x15B70BCC,/*游戏数据修改*/
	0x169CA0D1,/*水仙外挂*/
	0x5DAA256D,/*水仙外挂*/
	0x1F45316A,/*水仙外挂*/

	0x0AE4D45D,/*及时雨*/
	0x31AE3C60,/*简单外挂*/
	0x3E773F97,/*简单外挂*/
	0x3CD8F73B,/*简单外挂*/
	0x5A38A551,/*简单外挂*/
	0x62649F2E,/*简单外挂*/
	0x658A6A5D,/*荣耀外挂*/
	0x2532ABAB,/*无忧变速*/
	0x0708A972,/*无忧变速*/
	0x0F24A8DE,/*变速齿轮*
	0x131F1FC4,/*变速齿轮*
	0x359E52ED,/*变速齿轮*
	0x50EABE09,/*变速齿轮*
	0x338DB09D,/*变速齿轮*
	0x02740293,/*变速齿轮*
	0x4616A65A,/*变速齿轮*
	0x475540AE,/*变速齿轮*
	0x16AF4573,/*变速齿轮*
	0x0FD0C63F,/*变速齿轮*/
	0x0FF856F6,/*变速齿轮*/
	0x67C8E079,/*变速齿轮*/
	0x44604D2D,/*2021暗龙*/
	0x52EFA37A,/*2021刺客*/
	0x6C018827,/*驱动变速*/
	0x2D608CA5,/*驱动变速*/
	0x54698CBB,/*驱动变速*/
	0x7FB7692B,/*小可爱2021*/
	//-----------在此分割线之间维护内容-----------
];

let process_hash = api.enum_process_hash();
process_hash.forEach(function(e){
	if(process_hash_black_table.indexOf(e[1]) != -1)
	{
		api.report(9021, true, e[0]+"|"+e[1].toString(16));
	}
	if(process_hash_black_table2.indexOf(e[1]) != -1)
	{
		api.report(9020, true, e[0]+"|"+e[1].toString(16));
	}
})
//*************************** 图标检测 ***************************
